Description: Downloads the latest version of Skim and makes a pkg of it then uploads it to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: ch.ethz.id.jss.Example
Input:
  CATEGORY: Productivity
  EXTENSION_ATTRIBUTE: Versioner-ExtensionAttribute.xml
  GROUP_NAME: '%PROD_NAME% test users'
  GROUP_TEMPLATE: Versioner-SmartGroupTemplate.xml
  NAME: Example
  POLICY_CATEGORY: Untested
  POLICY_TEMPLATE: PolicyTemplate.xml
  PROD_NAME: '%NAME%'
  SELF_SERVICE_DESCRIPTION: |
    This is an example recipe that will not work since there is no such app.
  SELF_SERVICE_ICON: '%NAME%.png'
  STOP_IF_NO_JSS_UPLOAD: True
MinimumVersion: 0.4.0
ParentRecipe: INSERT-PARENT-RECIPE
Process:
- Arguments:
    category: '%CATEGORY%'
    extension_attributes:
    - ext_attribute_path: '%EXTENSION_ATTRIBUTE%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    pkg_path: '%pkg_path%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%NAME%'
    self_service_description: '%SELF_SERVICE_DESCRIPTION%'
    self_service_icon: '%SELF_SERVICE_ICON%'
    version: '%version%'
  Processor: JSSImporter
